Revit 2027 API
AssetPropertyList.GetValue Method
 Gets a collection of properties stored in this property list. These properties are copied.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<AssetProperty> GetValue()
Public Function GetValue As IList(Of AssetProperty)
public:
IList<AssetProperty^>^ GetValue()
member GetValue : unit -> IList<AssetProperty>
Return Value
IList<AssetProperty>
 Returns a copy of all the properties in this AssetPropertyList.
Remarks
 All the properties in the list are of the same AssetPropertyType. The AssetPropertyType can only be Integer, Double4, Float or Double, Enumeration.
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace